app/Validation/UserRules.php

    public function validateUser(string $str, string $fields, array $data)
    {
        $model = new UserModel();
        $user = $model->where('email', $data['email'])->first();
---
SELECT *
FROM "users"
WHERE "email" IS NULL
 LIMIT 1