app/Controllers/PersonController.php

    public function index()
    {
        $personModel = new PersonModel();
        $persons = $personModel->findAll();
---
SELECT *
FROM "person"

    public function count()
    {
        $personModel = new PersonModel();
        $total = $personModel->countAll();
---
SELECT COUNT(*) AS "numrows" FROM "person"