app/Controllers/ProjectController.php

SELECT *
FROM "project"
ORDER BY "dateend" DESC
---
    public function index()
    {
        $projectModel = new ProjectModel();
        $data = $projectModel->orderBy('dateend', 'DESC')->findAll();