app/Controllers/SkillController.php

SELECT *
FROM "skills"
---
    public function index()
    {
        $skillModel = new SkillModel();
        $skills = $skillModel->findAll();

SELECT COUNT(*) AS "numrows" FROM "skills"
---
    public function count()
    {
        $skillModel = new SkillModel();
        $total = $skillModel->countAll();